{
  "architectures": [
    "ModernBertForSequenceClassification"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": null,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "mean",
  "cls_token_id": 50281,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "dtype": "float32",
  "embedding_dropout": 0.0,
  "eos_token_id": null,
  "global_attn_every_n_layers": 3,
  "gradient_checkpointing": false,
  "hidden_activation": "gelu",
  "hidden_size": 768,
  "id2label": {
    "0": "AI_ARCHITECT",
    "1": "ANALYTICS_MANAGER",
    "2": "APPLIED_SCIENTIST",
    "3": "DATA_ANALYST",
    "4": "DATA_ENGINEER",
    "5": "GENAI_DATA_SCIENTIST",
    "6": "NLP_LLM_ENGINEER",
    "7": "PRODUCT_DATA_SCIENTIST",
    "8": "RESEARCH_SCIENTIST",
    "9": "RETAIL_ANALYTICS"
  },
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1152,
  "label2id": {
    "AI_ARCHITECT": 0,
    "ANALYTICS_MANAGER": 1,
    "APPLIED_SCIENTIST": 2,
    "DATA_ANALYST": 3,
    "DATA_ENGINEER": 4,
    "GENAI_DATA_SCIENTIST": 5,
    "NLP_LLM_ENGINEER": 6,
    "PRODUCT_DATA_SCIENTIST": 7,
    "RESEARCH_SCIENTIST": 8,
    "RETAIL_ANALYTICS": 9
  },
  "layer_norm_eps": 1e-05,
  "layer_types": [
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention"
  ],
  "local_attention": 128,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 12,
  "num_hidden_layers": 22,
  "pad_token_id": 50283,
  "position_embedding_type": "absolute",
  "rope_parameters": {
    "full_attention": {
      "rope_theta": 160000.0,
      "rope_type": "default"
    },
    "sliding_attention": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    }
  },
  "sep_token_id": 50282,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.4",
  "use_cache": false,
  "vocab_size": 50368
}
